#+TITLE: Urban FIA
#+AUTHOR: Tedward Erker
#+email: erker@wisc.edu
#+PROPERTY:  header-args:R :session *R* :cache no :results output :exports both :tangle yes

** Load Libraries
#+BEGIN_SRC R
  library(gdalUtils)
  library(stringr)
    library(rgdal)
    library(raster)
    library(rgeos)
  #  library(glcm)
  library(plyr)
    library(dplyr)
    library(doParallel)
  library(parallel)
  library(mlr)
#+END_SRC

#+RESULTS:
#+begin_example
Loading required package: sp
rgdal: version: 1.0-4, (SVN revision 548)
 Geospatial Data Abstraction Library extensions to R successfully loaded
 Loaded GDAL runtime: GDAL 1.10.0, released 2013/04/24
 Path to GDAL shared files: /usr/share/gdal/1.10
 Loaded PROJ.4 runtime: Rel. 4.8.0, 6 March 2012, [PJ_VERSION: 480]
 Path to PROJ.4 shared files: (autodetected)
 Linking to sp version: 1.1-1
rgeos version: 0.3-11, (SVN revision 479)
 GEOS runtime version: 3.4.2-CAPI-1.8.2 r3921
 Linking to sp version: 1.1-1
 Polygon checking: TRUE

Attaching package: ‘dplyr’

The following objects are masked from ‘package:plyr’:

    arrange, count, desc, failwith, id, mutate, rename, summarise,
    summarize

The following objects are masked from ‘package:rgeos’:

    intersect, setdiff, union

The following objects are masked from ‘package:raster’:

    intersect, select, union

The following objects are masked from ‘package:stats’:

    filter, lag

The following objects are masked from ‘package:base’:

    intersect, setdiff, setequal, union
Loading required package: foreach
foreach: simple, scalable parallel programming from Revolution Analytics
Use Revolution R for scalability, fault tolerance and more.
http://www.revolutionanalytics.com
Loading required package: iterators
Loading required package: parallel
Loading required package: BBmisc

Attaching package: ‘BBmisc’

The following object is masked from ‘package:dplyr’:

    collapse

The following object is masked from ‘package:rgeos’:

    symdiff

Loading required package: ggplot2
Loading required package: ParamHelpers

Attaching package: ‘ParamHelpers’

The following object is masked from ‘package:raster’:

    getValues


Attaching package: ‘mlr’

The following object is masked from ‘package:raster’:

    resample
#+end_example

** Set image name and directory and other variables
#+BEGIN_SRC R

      ##################
      #################                Specify image name and directory
      ##################

    #  image.name <- "longMadison"

      image.name <- "madison"
      image.rd.directory <- "../RD_NAIP-imagery/"
      image.dd.directory <- "../DD_NAIP-imagery/"

  dir.create(image.dd.directory)


#+END_SRC

#+RESULTS:
: Warning message:
: In dir.create(image.dd.directory) : '../DD_NAIP-imagery' already exists


** Crop image
Crop image to the extent of the urban area of interest, Madison
#+BEGIN_SRC R

  ##################
  #################                Specify WI Urban Area Shapefile name and directory (dsn)
  ##################

  US_UrbanAreas.name <- "cb_2013_us_ua10_500k"
  US_UrbanAreas.dsn <- "../RD_US_UrbanAreasShapefile/"


  US_UrbanAreas <- readOGR(dsn = US_UrbanAreas.dsn, layer = US_UrbanAreas.name)

  #WI_UrbanAreas <- US_UrbanAreas[str_detect(US_UrbanAreas$NAME10, "WI"),]

  Madison_UrbanArea <- US_UrbanAreas[str_detect(US_UrbanAreas$NAME10, "Madison, WI"), ]

  Madison_UrbanArea <- spTransform(Madison_UrbanArea, CRS("+init=epsg:26916"))

  # plot(Madison_UrbanArea)


  # Crop image

  e <- extent(Madison_UrbanArea)

  inFile <- str_c(image.dd.directory,image.name,".tif")
  outFile <- str_c(image.dd.directory,image.name,"-urbanExtent.tif")

  gdal_translate(inFile, outFile,
                 projwin = c(xmin(e), ymax(e), xmax(e), ymin(e)))


  image <- stack(outFile)

  plotRGB(image, 4, 3, 2)


#+END_SRC

#+RESULTS:
: NULL
: OGR data source with driver: ESRI Shapefile
: Source: "../RD_US_UrbanAreasShapefile/", layer: "cb_2013_us_ua10_500k"
: with 3601 features
: It has 8 fields
:  Warning: Computed -srcwin -366 -3350 39962 40594 falls partially outside raster extent. Going on however.
: NULL

** tile image
#+BEGIN_SRC R
    ##############
    #######                     Split image for parallel masking
  ##############

  filename <- str_c(image.dd.directory,image.name,"-urbanExtent.tif")

  dims <- as.numeric(
    strsplit(gsub('Size is|\\s+', '', grep('Size is', gdalinfo(filename), value=TRUE)), ',')[[1]]
  )



  # Set the window increment, width and height
  incr <- 1000
  win_width <- 1000
  win_height <- 1000

  # Create a data.frame containing coordinates of the lower-left
  #  corners of the windows, and the corresponding output filenames.
  xy <- setNames(expand.grid(seq(0, dims[1], incr), seq(dims[2], 0, -incr)),
                 c('llx', 'lly'))

  xy$nm <- paste0(xy$llx, '-', dims[2] - xy$lly, '.tif')


  dir.create(path = str_c(image.dd.directory,image.name,"-tiles"))

  cores <- detectCores()
  cl <- makeCluster(cores) # e.g. use 4 cores
  clusterExport(cl, c('split_rast', 'xy','filename','win_width','win_height','image.dd.directory'))


  system.time({
    parLapply(cl, seq_len(nrow(xy)), function(i) {
      split_rast(filename, paste0(image.dd.directory,"tiles/",xy$nm[i]), xy$llx[i], xy$lly[i], win_width, win_height)
    })
  })

  stopCluster(cl)


#+END_SRC

#+RESULTS:
: Error in get(name, envir = envir) : object 'split_rast' not found
:  Error in checkForRemoteErrors(val) (from #2) :
:   16 nodes produced errors; first error: could not find function "split_rast"
: Timing stopped at: 0.008 0 0.009

*** For untiled image
#+BEGIN_SRC R
    cropped_image.name <- str_c("CroppedImage/cropped_",image.name,".tif")

    image <- stack(cropped_image.name)
    names(image) <- c("red","green","blue","nir")

    # Create a ratio image for each band
    ratios <- lapply(1:4, function(x){
        ratio(image, x)
    })

  ratio.brick <- ratio(image)
  names(ratio.brick) <- str_c(c("blue","green","red","nir"),rep("_ratio",times = 4))

                                              # save ratios
  dir.create("RatiosImage")
  writeRaster(ratio.brick, str_c("RatiosImage/ratios_",image.name,".tif"), overwrite = T)



                                          # Create NDVI image


  ndvi <- ndvi_nodrop(image, 3, 4)

  dir.create("NDVIImage")
  writeRaster(ndvi, str_c("NDVIImage/ndvi_",image.name,".tif"), overwrite = T)
#+END_SRC

#+RESULTS:
: Warning message:
: In dir.create("RatiosImage") : 'RatiosImage' already exists
: Error in .getGDALtransient(x, filename = filename, options = options,  :
:   filename exists; use overwrite=TRUE
: Warning message:
: In dir.create("NDVIImage") : 'NDVIImage' already exists
: Error in .getGDALtransient(x, filename = filename, options = options,  :
:   filename exists; use overwrite=TRUE

*** of a single small scene
#+BEGIN_SRC R
  segPath <- paste0("SegmentationImage/")
  segNames <- list.files(path = segPath)

  lapply(segNames, function(x) {
      seg <- raster(paste0(segPath,x))
      s <- gdal_polygonizeR(seg)
      writeOGR(obj = s, dsn = paste0("Seg_Shapefiles"), layer = x,
               driver = "ESRI Shapefile",
               overwrite=TRUE)
  })
#+END_SRC

#+RESULTS:
#+begin_example
 Creating output /var/folders/yj/vjkj1yyx1n510rf_rggqdb640000gr/T//RtmpiEs2yf/filea9c33dcf239.shp of format ESRI Shapefile.
0...10...20...30...40...50...60...70...80...90...100 - done.
Creating output /var/folders/yj/vjkj1yyx1n510rf_rggqdb640000gr/T//RtmpiEs2yf/filea9c74595d36.shp of format ESRI Shapefile.
0...10...20...30...40...50...60...70...80...90...100 - done.
Creating output /var/folders/yj/vjkj1yyx1n510rf_rggqdb640000gr/T//RtmpiEs2yf/filea9c21b0e278.shp of format ESRI Shapefile.
0...10...20...30...40...50...60...70...80...90...100 - done.
[[1]]
NULL

[[2]]
NULL

[[3]]
NULL
#+end_example

Segmentations that I will use:



|   | Average Pixel number | Compactness |
|---+----------------------+-------------|
|   |                   15 |          10 |
|   |                   30 |          15 |
|   |                   45 |          31 |
|   |                   60 |          30 |
|   |                  105 |          32 |
|   |                      |             |


think I'll try the best compactness from pixel number 15, 30, 60,
and 105.  Other sizes looked good too, but I think 105 is near the
upper limit.  Smaller than 15 doesn't make much sense either.


*** Calculate zonal statistics for each segment for each tile.
#+BEGIN_SRC R
  # Create Directory to store features (inputs I will use to predict on)
  segment.features.path <- str_c(image.dd.directory, image.name,"-SegmentFeatureDFs/")

  dir.create(path = segment.features.path)

  seg.tile.paths <- list.files(str_c(image.dd.directory, image.name, "-SegTiles"), full.names = T)

  seg.tile.paths <- seg.tile.paths[str_detect(seg.tile.paths, "\\.tif$")]


  seg.tile.names <- list.files(str_c(image.dd.directory, image.name, "-SegTiles"), full.names = F)
  seg.tile.names <- seg.tile.names[str_detect(seg.tile.names, "\\.tif$")]

  #remove ".tif"
  seg.tile.names <- sapply(seg.tile.names, function(s) str_sub(s, end = nchar(s) - 4))


  tiles <- str_extract(seg.tile.paths, "[0-9]+-[0-9]+\\.tif")

  ratio.tile.paths <- sapply(tiles, function(t) {
                                str_c(image.dd.directory, image.name, "-RatioTiles/", t)
                            })

  extract_segment_features <- function(ratios.tile.path, seg.tile.path, seg.tile.name) {
      r.tile <- stack(ratios.tile.path)
      names(r.tile) <- c("blue","green","red","nir","b_ratio","g_ratio","r_ratio","n_ratio","ndvi")
      s.tile <- raster(seg.tile.path)

  # Create a data_frame where mean and variances are calculated by zone
      # calculate means
      means <- zonal(x = r.tile, z = s.tile, 'mean', na.rm = F, digits = 1)
      colnames(means)[2:ncol(means)] <- paste0(colnames(means)[2:ncol(means)], "_mean")

                                              # calculate sd
      sds <- zonal(x = r.tile, z = s.tile, 'sd', na.rm = F)
      colnames(sds)[2:ncol(sds)] <- paste0(colnames(sds)[2:ncol(sds)], "_sd")

      d <- merge(means,sds)
      saveRDS(d, file = paste0(segment.features.path, seg.tile.name,".rds"))
      print(seg.tile.name)
  }

    cl <- makeCluster(detectCores())
    registerDoParallel(cl)

  foreach (i = seq_along(ratio.tile.paths), .packages = c("raster")) %dopar% {
      extract_segment_features(ratio.tile.paths[i], seg.tile.paths[i], seg.tile.names[i])
  }


#+END_SRC

#+RESULTS:
#+begin_example
Warning message:
In dir.create(path = segment.features.path) :
  '../DD_NAIP-imagery/madison-SegmentFeatureDFs' already exists
 Error in stri_detect_regex(string, pattern, opts_regex = attr(pattern,  :
  object 'seg.tile.names' not found
 Error in stri_detect_regex(string, pattern, opts_regex = attr(pattern,  :
  object 'seg.tile.names' not found
Error in lapply(X = X, FUN = FUN, ...) :
  object 'seg.tile.names' not found
Error in stri_extract_first_regex(string, pattern, opts_regex = attr(pattern,  :
  object 'seg.tile.paths' not found
 Error in lapply(X = X, FUN = FUN, ...) : object 'tiles' not found
 Error in eval(expr, envir, enclos) : object 'ratio.tile.paths' not found
#+end_example

*** crop naip image
    #+BEGIN_SRC R :exports both
  urban.image <- crop(image, study.cities)
  png(paste0(directory,"madison_",imagename))
  plotRGB(urban.image,4,3,2, stretch = "lin")
  dev.off()
    #+END_SRC

    #+RESULTS:
    : Warning message:
    : closing unused connection 3 (/private/var/folders/yj/vjkj1yyx1n510rf_rggqdb640000gr/T/R_raster_tedward/r_tmp_2015-11-02_103202_3700_41559.gri)
    : Error in paste0(directory, "madison_", imagename) :
    :   object 'directory' not found
    : Error in plotRGB(urban.image, 4, 3, 2, stretch = "lin") :
    :   error in evaluating the argument 'x' in selecting a method for function 'plotRGB': Error: object 'urban.image' not found
    : null device
    :           1

**** add ratios
     #+BEGIN_SRC R
       ## namedList <- function(...) {
       ##   L <- list(...)
       ##   snm <- sapply(substitute(list(...)),deparse)[-1]
       ##   if (is.null(nm <- names(L))) nm <- snm
       ##   if (any(nonames <- nm=="")) nm[nonames] <- snm[nonames]
       ##   setNames(L,nm)
       ## }

       ## savi_nodrop <- function(image_w4bands,red_bandnumber,nir_bandnumber,L,...) {
       ##   red_band <- image_w4bands[,,red_bandnumber,drop=FALSE]
       ##   nir_band <- image_w4bands[,,nir_bandnumber,drop=FALSE]
       ##   savi <- (nir_band - red_band)/(nir_band + red_band + L) * (1+L)
       ##   return(savi)
       ## }

       ## ratio <- function(image_w4bands, numerator_bandNumber) {
       ##   r <- image_w4bands[,,numerator_bandNumber,drop = F] / sum(image_w4bands)
       ##   return(r)
       ## }

       calc_ndvi <- function(x){(x$nir - x$red)/(x$nir + x$red)}

       beginCluster()
       ndvi <- clusterR(x = image, fun = calc_ndvi)
       endCluster()

       writeRaster(x = ndvi, paste0(directory,"NDVI_",imagename,".tif"), overwrite = T)



     #+END_SRC

     #+RESULTS:
     : 4cores detected
     : [1] "invalid layer names"
     : attr(,"class")
     : [1] "snow-try-error" "try-error"
     : Error in clusterR(x = image, fun = calc_ndvi) : cluster error
     : Error in .getGDALtransient(x, filename = filename, options = options,  :
     :   filename exists; use overwrite=TRUE

**** add texture (glcm)
     #+BEGIN_SRC R
       ndvi <- raster("NAIP/NDVI_madison_naip.tif")
       imagename <- "madison_naip"
       statistics <- c("variance", "homogeneity", "contrast",
                       "dissimilarity", "entropy","second_moment",
                       "correlation")

       shift <- list(c(1,-1))
       window <- list(c(3,3),c(5,5))


       cl <- makeCluster(4 )

       registerDoParallel(cl)


       # I changed the code from %dopar% to %do% because I don't think I'll have enough memory to run in parallel.  Running on the server, I'll need to change back to %dopar%
       foreach(j = 1:length(statistics), .packages=c('raster', 'glcm')) %do% {
         for (i in 1:length(window)) {
             GLCM <- glcm(ndvi, window=window[[i]], statistics=statistics[j],
                          shift = shift, na_opt="ignore")
             file <- paste0(directory,"texture/",imagename,"_",names(GLCM),"_window",window[[i]][1],".tif")
             writeRaster(GLCM, filename = file, type = "GTIFF")
           }
         }

       stopCluster(cl)




     #+END_SRC

     #+RESULTS:
     #+begin_example
     [[1]]
     NULL

     [[2]]
     NULL

     [[3]]
     NULL

     [[4]]
     NULL

     [[5]]
     NULL

     [[6]]
     NULL

     [[7]]
     NULL

     Warning messages:
     1: closing unused connection 8 (<-localhost:11575)
     2: closing unused connection 7 (<-localhost:11575)
     3: closing unused connection 6 (<-localhost:11575)
#+end_example

** Wisconsin Urban Areas
#+BEGIN_SRC R

  ua <- urban_areas(cb = T) # Download genearlized (1:500k) boundary file of all US urban areas

  WI <- states(cb = T, ) %>%                 # Download WI shapefile
       subset(NAME == "Wisconsin") %>%
       gBuffer(width = .0001)


  ua_wi <- crop(x = ua, y = WI)  # Crop urban areas to Wisconsin


  factpal <- colorFactor(topo.colors(50), ua_wi$NAME10)
  ua_map <- ua_wi %>% leaflet() %>% addTiles() %>% addPolygons(color = ~factpal(NAME10), popup = ~NAME10)
  ua_map

  ua_map %>% saveWidget(file = "WisconsinUrbanAreas.html", selfcontained = FALSE)

  ua_wi

#+END_SRC

#+RESULTS:
#+begin_example
Warning message:
In readOGR(dsn = cache_dir, layer = shape, encoding = "UTF-8", verbose = FALSE,  :
  Z-dimension discarded
 Warning messages:
1: In readOGR(dsn = cache_dir, layer = shape, encoding = "UTF-8", verbose = FALSE,  :
  Z-dimension discarded
2: In gBuffer(., width = 1e-04) :
  Spatial object is not projected; GEOS expects planar coordinates
class       : SpatialPolygonsDataFrame
features    : 124
extent      : -92.80608, -87.33629, 42.48958, 46.75224  (xmin, xmax, ymin, ymax)
coord. ref. : +proj=longlat +datum=NAD83 +no_defs +ellps=GRS80 +towgs84=0,0,0
variables   : 8
names       : UACE10,     AFFGEOID10, GEOID10,          NAME10, LSAD10, UATYP10,    ALAND10,  AWATER10
min values  :  00091, 400C100US00091,   00091,  Abbotsford, WI,     75,       C,    2639602,         0
max values  :  97359, 400C100US97359,   97359, Wrightstown, WI,     76,       U, 6325855004, 231673974
#+end_example

There are 124 urban areas in the state of Wisconsin

** Naip seamlines
#+BEGIN_SRC R

  seams <- readOGR(dsn = "../RD_NAIP-imagery/SeamLines", layer = "ortho_naip_seamline-naipseamlines2013_a_wi")

  seams_html <- seams %>% leaflet %>% addTiles() %>% addPolygons()
  seams_html %>% saveWidget(file = "NAIP_seams.html")


  # Add column that identifies each polygon by start and end date/time
  seams@data <- seams@data %>%
      mutate(uid = as.factor(paste0(SDATE,"_",EDATE)))

  #crop seams by urban areas
  seams_by_ua <- crop(seams,ua_wi)



  factpal <- colorFactor(topo.colors(50), seams_by_ua$uid)
  seams_by_ua_html <- seams_by_ua %>%
      leaflet() %>%
      addTiles() %>%
      addPolygons(color = ~factpal(uid), popup = paste("Date", seams_by_ua$IDATE, "<br>",
                                                         "Start Date", seams_by_ua$SDATE,"<br>",
                                                         "End Date", seams_by_ua$EDATE))


  seams_by_ua_html

  seams_by_ua_html %>% saveWidget(file = "seams_by_urbanArea.html", selfcontained = FALSE)

  seams_by_ua

  str(seams_by_ua@data$uid))
  n_distinct(seams_by_ua@data$uid)
#+END_SRC

#+RESULTS:
: OGR data source with driver: ESRI Shapefile
: Source: "../RD_NAIP-imagery/SeamLines", layer: "ortho_naip_seamline-naipseamlines2013_a_wi"
: with 243 features and 12 fields
: Feature type: wkbPolygon with 2 dimensions
:  Error: unexpected symbol in:
: "
: seams"

There appear to be 96 NAIP seams over urban areas.  Do we need to
build a model for each one?  Probably not, but training data should
come from all of them if we are going to build on large classification model.


**** add texture (glcm)
     #+BEGIN_SRC R
        statistics <- c("mean","variance", "homogeneity", "contrast",
                        "dissimilarity", "entropy","second_moment",
                        "correlation")

        shift <- list(c(1,1)) # 135 degree,
        window <- list(c(3,3))


       dir.create(path = paste0(imageDirectory,"texture_",imageName))

        cl <- makeCluster(2)

       registerDoParallel(cl)


        # I changed the code from %dopar% to %do% because I don't think I'll have enough memory to run in parallel.  Running on the server, I'll need to change back to %dopar%
        foreach(j = 1:length(statistics), .packages=c('raster', 'glcm')) %dopar% {
          for (i in 1:length(window)) {
              GLCM <- glcm(ndvi, window=window[[i]], statistics=statistics[j],
                           shift = shift, na_opt="ignore")
              file <- paste0(imageDirectory,"texture_",imageName,"/",imageName,"_",names(GLCM),"_window",window[[i]][1],".tif")
              writeRaster(GLCM, filename = file, type = "GTIFF", overwrite = T)
            }
          }

        stopCluster(cl)

     #+END_SRC

     #+RESULTS[3883f7544e7fbc95662b9950eeb0f50c8c48de67]:
     #+begin_example
     Warning message:
     In dir.create(path = paste0(imageDirectory, "texture_", imageName)) :
       'NAIP/texture_small_Mad' already exists
     [[1]]
     NULL

     [[2]]
     NULL

     [[3]]
     NULL

     [[4]]
     NULL

     [[5]]
     NULL

     [[6]]
     NULL

     [[7]]
     NULL

     [[8]]
     NULL
#+end_example

*** Perform PCA and select vegetation/urban related components
#+BEGIN_SRC R
    all <- stack(image, ndvi)

  # Function takes raster stack, samples data, performs pca and returns stack of first n_pcomp bands
  predict_pca_wSampling_parallel <- function(stack, sampleNumber, n_pcomp, nCores = detectCores()-1) {
      sr <- sampleRandom(stack,sampleNumber)
      pca <- prcomp(sr, scale.=T)
      beginCluster()
      r <- clusterR(stack, predict, args = list(pca, index = 1:n_pcomp))
      endCluster()
      return(r)
  }


  # perform PCA with 4 original bands and ndvi
  rgbnn_pca <- predict_pca_wSampling_parallel(all, 10000, 5)




  # Save these PCA's
  PCA_directory <- paste0(imageDirectory,"PCA_",imageName)
  dir.create(path = PCA_directory)
  writeRaster(rgbnn_pca, paste0(PCA_directory,"/",imageName,"rgbnn_pca.tif"), overwrite = T)
#+END_SRC

#+RESULTS:
: 2cores detected
: Warning message:
: In dir.create(path = PCA_directory) : 'NAIP/PCA_small_Mad' already exists

*** Segment Image

#+BEGIN_SRC sh :eval no
  python Python/fia_segment.py
#+END_SRC

#+RESULTS:
: python Python

#+BEGIN_SRC python :eval yes
  from skimage.segmentation import slic, mark_boundaries
  import gdal
  import os
  import numpy as np
  import matplotlib.pyplot as plt
  # from skimage.util import img_as_float
  from skimage import io

  # image_path = r"C:\_urban_fia\fia_data\SPOT_subset_subset_rgb.tif"
  # image = io.imread(image_path)
  # image = image[:, : , 0:-1]
  # print image

  number_pixels_per_seg = 20
  source_raster_path = os.path.expanduser('~/GoogleDrive/Pjt_UFIA/NAIP/PCA_small_Mad/small_Madrgbnn_pca.tif')
  target_raster_path = os.path.expanduser('~/GoogleDrive/Pjt_UFIA/NAIP/Seg/seg_raster.tif')

  def build_tiff(source_raster_path, target_raster_path, image_array):

      source_raster = gdal.Open(source_raster_path)
      bands = source_raster.RasterCount
      columns = source_raster.RasterXSize
      rows = source_raster.RasterYSize
      driver = gdal.GetDriverByName("GTiff")
      new_image = driver.Create(target_raster_path, columns, rows, 1, gdal.GDT_Float64)
      new_image.SetGeoTransform(source_raster.GetGeoTransform())
      new_image.SetProjection(source_raster.GetProjectionRef())

      new_image.GetRasterBand(1).WriteArray(image_array)
      '''
      for band in range(bands):
          new_image.GetRasterBand(band+1).WriteArray(image_array[band, :, :])
      '''
      return

  # Grab Raster metadata using GDAL
  source_raster = gdal.Open(source_raster_path)
  bands = source_raster.RasterCount
  columns = source_raster.RasterXSize
  rows = source_raster.RasterYSize
  data_type = source_raster.GetRasterBand(1).DataType  # 2 = UInt16

  array = source_raster.ReadAsArray()

  array = array.transpose(1, 2, 0)  # Transpose TIFF space to a more sensible numpy array orientation

  array = array[:, :, 0:3]  # Can be used to constrain number of principal components to use (change final list term)

  number_pixels_per_seg = np.array(100)
  num_segs = rows * columns / number_pixels_per_seg

  compactness = [20,25,30,35]
  print 'Making segments'

  n = num_segs
  c = 300

  target_raster_path = '/Users/tedward/GoogleDrive/Pjt_UFIA/NAIP/Seg/segRasterN%sC%s.tif' %(n,c)
  segments = slic(array, n_segments=n, compactness=c, enforce_connectivity=True)
  print 'Made dem segments'
  build_tiff(source_raster_path, target_raster_path, segments)
  print 'Tiff made successfully'


  #for n in num_segs :
  #    for c in compactness :
          # target_raster_path = '/Users/tedward/GoogleDrive/Pjt_UFIA/NAIP/Seg/segRasterN%sC%s.tif' %(n,c)
          # segments = slic(array, n_segments=n, compactness=c, enforce_connectivity=True)
          # print 'Made dem segments'
          # build_tiff(source_raster_path, target_raster_path, segments)
          #print 'Tiff made successfully'

    #+END_SRC

    #+RESULTS:
    : None



*** Polygonize Segments
#+BEGIN_SRC R
  segPath <- paste0(imageDirectory,"/Seg")
  segNames <- list.files(path = segPath)

  lapply(segNames, function(x) {
      seg <- raster(paste0("NAIP/Seg/",x))
      s <- gdal_polygonizeR(seg)
      writeOGR(obj = s, dsn = paste0(imageDirectory,"/Seg_Shapefiles"), layer = x, driver = "ESRI Shapefile")
  })
#+END_SRC

#+RESULTS:
:  Creating output /var/folders/yj/vjkj1yyx1n510rf_rggqdb640000gr/T//Rtmpbyxm9p/file199a5a9c8fc4.shp of format ESRI Shapefile.
: 0...10...20...30...40...50...60...70...80...90...100 - done.
: [[1]]
: NULL


Segmentation parameters that I think are good:

|   | size | compactness |      |                                                                                                 |
|---+------+-------------+------+-------------------------------------------------------------------------------------------------|
|   |    7 |          30 | good |                                                                                                 |
|   |    5 |          30 | good | This is the one I'm going to try to use.                                                        |
|   |  100 |         300 | good | I've made training data for this one. The segments are bigger, but maybe better.  Need to test. |
|   |      |             |      |                                                                                                 |




*** Calculate zonal statistics for image based on segmentation, extract features from segments

#+BEGIN_SRC R
  segName <- "segRasterN10579C300"

  segDirectory <- paste0(imageDirectory,"Seg/")

  segmentationLayerPath <- paste0(segDirectory,segName,".tif")

  image <- stack(RD_imagePath)
  names(image) <- c("blue", "green", "red", "nir")

  ndvi <- raster(paste0(imageDirectory,"NDVI/",imageName,"_NDVI.tif"))
  names(ndvi) <- "ndvi"

  r <- stack(image, ndvi)

  seg <- raster(segmentationLayerPath)



                                          # Create a data_frame where mean and variances are calculated by zone
  # calculate means
  means <- zonal(x = r, z = seg, 'mean')
  colnames(means)[2:6] <- paste0(colnames(means)[2:6], "_mean")

                                          # calculate sd
  sds <- zonal(x = r, z = seg, 'sd')
  colnames(sds)[2:6] <- paste0(colnames(sds)[2:6], "_sd")

  d <- merge(means,sds)

  write.csv(d, paste0(imageDirectory, "SegmentFeatureDataFrames/",imageName,"_",segName,"_features.csv"))

                                          # Read in the training data from the shapefile
  DSN <- paste0(imageDirectory,"Seg_Shapefiles/")

  train <- readOGR(dsn = DSN, layer = paste0(segName,".tif"))@data %>%
                                             na.omit() %>%
                                             rename(zone = DN)

  dat <- left_join(train,d)

                                          # Save this dataframe


  write.csv(dat, paste0(imageDirectory,"TrainingDataFrames/",imageName,"_",segName,"TrainData.csv"))
#+END_SRC

#+RESULTS:
:  OGR data source with driver: ESRI Shapefile
: Source: "NAIP/Seg_Shapefiles/", layer: "segRasterN10579C300.tif"
: with 10553 features and 2 fields
: Feature type: wkbPolygon with 2 dimensions
: Joining by: "zone"




*** Predict
#+BEGIN_SRC R
        #load models
        modelsPath <- paste0(imageDirectory, "Models/",imageName, "_", segName,".Rdata")
    load(file = modelsPath)
    models <- unlist(models, recursive = F)

                                                #load segmenation
        seg <- raster(paste0("NAIP/Seg/",segName,".tif"))

        imgdata <- read.csv(paste0(imageDirectory, "SegmentFeatureDataFrames/",imageName,"_",segName,"_features.csv"))


  # Write Classified Rasters
    cl<-makeCluster(nCores)
    registerDoParallel(cl)
  #  mod <- models[[5]]
    foreach(mod = models, .packages = c("leaflet", "mlr", "raster", "htmlwidgets", "dplyr")) %dopar% {
        predicted <- predict(mod, newdata = imgdata[3:12])  # predict model on image segments df
        # create reclassification, reclassify and assign levels
        response <- factor(as.character(predicted$data$response), levels = c("G","I","T","O"))
        m <- cbind(imgdata$zone,response)
        r <- reclassify(seg, m)
        x <- data.frame(ID = 1:4, LandCover = c("G","I","T","O")) %>%
            filter(LandCover == levels(factor(response)))
        levels(r) <- x
        writeRaster(r, paste0("ClassifiedRasters",mod$task.desc$id,"_",mod$learner$id,".tif")
    }

        setwd("/Users/tedward/GoogleDrive/Pjt_UFIA")

    endCluster()

                                          # Send Raster to Leaflet

  rasterFileNames <- list.files("ClassifiedRasters", pattern = ".+tif$", full.names = T)
  r <- lapply(rasterFileNames, raster)



  setwd("LeafletMaps")

      coldf <- data_frame(colors = c("#ffff99", "#beaed4", "#7fc97f", "#7e7e7e"), LandCover = c("G","I","T","O"))
       cols <- coldf %>%
            filter(LandCover %in% levels(r[[13]])[[1]]$category) %>%
            select(colors)

        types1 <- levels(r[[13]])[[1]][,1]
        pal1 <- colorFactor(cols$colors, types1)

        types2 <- levels(r[[14]])[[1]][,1]
        pal2 <- colorFactor(cols$colors, types2)

        types3 <- levels(r[[15]])[[1]][,1]
        pal3 <- colorFactor(cols$colors, types3)

        types4 <- levels(r[[16]])[[1]][,1]
        pal4 <- colorFactor(cols$colors, types3)

        map <- leaflet() %>% addProviderTiles("Esri.WorldImagery", group = "ESRI") %>%
            addRasterImage(r[[13]], group = names(r[[13]]), colors = pal1, opacity = 0.6) %>%
            addRasterImage(r[[14]], group = names(r[[14]]), colors = pal2, opacity = 0.6) %>%
            addRasterImage(r[[15]], group = names(r[[15]]), colors = pal1, opacity = 0.6) %>%
            addRasterImage(r[[16]], group = names(r[[16]]), colors = pal2, opacity = 0.6) %>%
            addLayersControl(
                overlayGroups = c("ESRI",names(r[[13]]),names(r[[14]]), names(r[[15]]), names(r[[16]])),
                options = layersControlOptions(collapsed = FALSE)
            )


  map

        saveWidget(map, file = "tree.html", selfcontained = F)

        saveWidget(map, file = paste0(mod$task.desc$id,mod$l,"_",mod$learner$id,".html"),selfcontained = F)







        predicted <- predict(mod, newdata = imgdata[3:12])

        m <- cbind(imgdata$zone,predicted$data$response)
        r <- reclassify(seg, m)



        x <- levels(as.factor(r))[[1]]
        x$LandCover <- levels(predicted$data$response)

        levels(r) <- x

        cols <- coldf %>%
            filter(LandCover == levels(predicted$data$response)) %>%
            select(colors)

        ## m <- data.frame(zone = imgdata$zone,predicted$data$response)
        ## str(m)
        ## rdf <- as.data.frame(seg, xy  = T)
        ## names(rdf)[3] <- "zone"
        ## dat <- left_join(rdf, m)

      # Send Raster to Leaflet

        types <- levels(r)[[1]][,1]
        pal <- colorFactor(cols, types)
        map <- leaflet() %>% addProviderTiles("Esri.WorldImagery", group = "ESRI") %>%
            addRasterImage(r, group = "r", colors = pal, opacity = 0.6) %>%
            addLayersControl(
                overlayGroups = c("ESRI","r"),
                options = layersControlOptions(collapsed = FALSE)
                )


        saveWidget(map, file = paste0(mod$task.desc$id,mod$l,"_",mod$learner$id,".html"),selfcontained = F)
    }
        setwd("/Users/tedward/GoogleDrive/Pjt_UFIA")


    endCluster()




     types <- levels(r)[[1]][,2]
        pal <- colorFactor(c("#ffff99", "#beaed4", "#7fc97f"), types)
    pal <- colorFactor(c("#ffff99", "#beaed4", "#7fc97f","#7e7e7e"), types, levels = c("G","I","T","O"))
        #pal <- colorFactor(c("#ffff99", "#beaed4", "#7fc97f","#7e7e7e"), c("G","I","T","O"))

        map <- leaflet() %>% addProviderTiles("Esri.WorldImagery", group = "ESRI") %>%
            addRasterImage(r, group = "r", colors = pal, opacity = 0.6) %>%
            addLayersControl(
                overlayGroups = c("ESRI","r"),
                options = layersControlOptions(collapsed = FALSE)
                )
#+END_SRC

#+RESULTS:
#+begin_example
 Error: unexpected '}' in:
"      writeRaster(r, paste0("ClassifiedRasters",mod$task.desc$id,"_",mod$learner$id,".tif")
  }"
 Warning messages:
1: closing unused connection 6 (<-localhost:11247)
2: closing unused connection 5 (<-localhost:11247)
3: In colors(.) :
  Some values were outside the color scale and will be treated as NA
 Error in levels(predicted$data$c(4L, 4L, 4L, 4L, 4L, 4L, 4L, 4L, 4L, 4L,  :
  error in evaluating the argument 'x' in selecting a method for function 'levels': Error in predicted$data$c(4L, 4L, 4L, 4L, 4L, 4L, 4L, 4L, 4L, 4L, 4L,  :
  invalid subscript type 'integer'
Error in UseMethod("toPaletteFunc") :
  no applicable method for 'toPaletteFunc' applied to an object of class "c('tbl_df', 'tbl', 'data.frame')"
 Warning message:
In colors(.) :
  Some values were outside the color scale and will be treated as NA
Error: unexpected '}' in "  }"
 Warning message:
In colors(.) :
  Some values were outside the color scale and will be treated as NA
#+end_example











